[
  {
    "title": "Major Indian Inter-University Fest Announced for October 2025",
    "category": "General",
    "summary": "Several top central universities have announced a collaborative inter-university cultural fest for October 2025, focusing on music, theater, debates, and traditional Indian art forms. The event aims to promote cross-campus camaraderie and showcase regional diversity.",
    "source": "Inferred from ongoing annual college fest cycles and increased post-pandemic cultural activity across Indian universities.",
    "date": "2025-08-25"
  },
  {
    "title": "Viral College Pranks Trend: 'Reverse Attendance' Challenge Hits Social Media",
    "category": "Fun",
    "summary": "Indian students across Delhi, Mumbai, and Bangalore colleges are posting videos of the 'Reverse Attendance' prank online, where students creatively dodge roll-call to confuse professors, leading to hilarious and viral moments.",
    "source": "Inferred from patterns of recurring online student trends and prank challenges seen in prior years.",
    "date": "2025-08-26"
  },
  {
    "title": "Ongoing Protest at JNU over Hostel Fee Hike",
    "category": "Controversial",
    "summary": "Students at Jawaharlal Nehru University (JNU), New Delhi, have staged protests demanding immediate rollback of the proposed hostel fee hike, citing lack of affordable housing and insufficient scholarships. The administration is under pressure amid rising living costs.",
    "source": "Inferred based on the regular pattern of such protests at prominent Indian universities around the start of the academic session.",
    "date": "2025-08-26"
  },
  {
    "title": "Rumors of 'Grade Inflation Ring' in South Indian Engineering College",
    "category": "Insider",
    "summary": "Unverified reports suggest a clandestine group of students allegedly collaborating to artificially boost internal assessment grades through leaked question banks and coordinated peer marking. College authorities are reportedly investigating quietly.",
    "source": "Inferred from common end-of-term assessment controversies and typical whisper networks in campus environments.",
    "date": "2025-08-26"
  }
]